# Adding attributes

In [5]:
import pandas as pd
df=pd.DataFrame({'data':['10/2/2011','11/2/2011','12/2/2011','13/2/2011'],
                 'event':['music','poetry','theatre','comedy'],
                 'cost':[10000,50000,15000,20000]})
print(df)

        data    event   cost
0  10/2/2011    music  10000
1  11/2/2011   poetry  50000
2  12/2/2011  theatre  15000
3  13/2/2011   comedy  20000

In [6]:
df=pd.DataFrame({'Name':['john','ted','dove','brad','rex'],
                'salary':[44000,35000,75000,20000,6000]})
print(df)

   Name  salary
0  john   44000
1   ted   35000
2  dove   75000
3  brad   20000
4   rex    6000

In [7]:
def salary_stats(value):
    if value<1000:
        return "very low"
    elif 10000<=value<25000:
        return "low"
    elif 25000<=value<40000:
        return "average"
    elif 40000<=value<50000:
        return "better"
    elif value>=50000:
        return "very good"
df['salary_stats']=df['salary'].map(salary_stats)
df

   Name  salary salary_stats
0  john   44000       better
1   ted   35000      average
2  dove   75000    very good
3  brad   20000          low
4   rex    6000         None

In [24]:
import pandas as pd
data=pd.DataFrame({'Name':['A','B','c','D','E','F'],
                   'Education':['High school','Masters','Doctorate','Bachelors','Masters','KAVYA']})
data

  Name    Education
0    A  High school
1    B      Masters
2    c    Doctorate
3    D    Bachelors
4    E      Masters
5    F        KAVYA

# Binary encoding

In [25]:
education_data=pd.get_dummies(data.Education)
print(education_data)

   Bachelors  Doctorate  High school  KAVYA  Masters
0          0          0            1      0        0
1          0          0            0      0        1
2          0          1            0      0        0
3          1          0            0      0        0
4          0          0            0      0        1
5          0          0            0      1        0

# Ranking transformation

In [28]:
education_map ={ 
    'High school':1,
    'Bachelors':2,
    'Master':3,
    'doctorate':4,
}
education_data = data['Education'].map(education_map)
data['Education'] = education_data
data

  Name  Education
0    A        NaN
1    B        NaN
2    c        NaN
3    D        NaN
4    E        NaN
5    F        NaN

In [21]:
education_map = {
'High School' : 12,
'Bachelors' : 16,
'Masters': 18,
'Doctorate': 21
}
education_data = data['Education'].map(education_map)
data['Education'] = education_data
data

  Name  Education
0    A        NaN
1    B        NaN
2    c        NaN
3    D        NaN
4    E        NaN